<?php

return [
  'summoner' => [
    '404' => 'Профиль призывателя не найден!'
  ],
  'code' => [
    '404'       => 'Код не найден! Проверте введен ли код в лаунчере LoL!',
    '500'       => 'В этой ошибке виноваты сервера LoL от RIOT, к сожалению мы ничего не можем предпринять, мы можем только верить и надеяться что они скоро все исправят!<br>
                        Эта ошибка указывает на непредвиденное условие или исключение, которое помешало серверу выполнить запрос API.<br>
                        Попробуйте попозже!',
    '230000'    => 'Такой аккаунт уже есть в базе, используйте другой!',
    'mismatch'  => 'Код в лаунчере LoL не соответствует необходимому!'
  ],
  'icon' => [
    'mismatch'  => 'Смените аватар в игре на предложенный сайтом для проверки аккаунта!'
  ],
  'lol' => [
    'roles' => [
      'top'   => 'Топ',
      'jung'  => 'Лес',
      'mid'   => 'Мид',
      'adc'   => 'Адк',
      'sup'   => 'Саппорт'
    ]
  ]
];
